	<meta name='viewport' content="width=device-width">

    <link rel="stylesheet" href="http://netdna.bootstrapcdn.com/bootstrap/3.1.1/css/bootstrap.min.css">
    <link rel="stylesheet" href="http://netdna.bootstrapcdn.com/bootstrap/3.1.1/css/bootstrap-theme.min.css">
    <link rel="stylesheet" href="//ajax.googleapis.com/ajax/libs/jqueryui/1.10.4/themes/smoothness/jquery-ui.css" />
	<link rel="stylesheet" href="/css/prism.css">
	<link rel="stylesheet" href="../css/style.css"></link>
	<style>
	body {
	  padding-top: 30px;
	}
	.starter-template {
	  padding: 40px 15px;
	  text-align: center;
	}
	pre{
		border:0px;
		border-radius: 0px; 
	}
	code{
		background-color: #f5f5f5;
		color: black;
	}

	iframe.graph{
		border: 0;
	    display: block;
	    margin-left: auto;
	    margin-right: auto;
	}
	h4{
		font-weight: 600;
	}
</style>

<div class="container">
	<div class="row">
		<div class="col-md-12">

<a href="/">back to main</a> <br> <br> 
<h1>Basic Neo4j Language Graph</h1>

<p>So lets do something fun with big graphs. We are going to do a quick install of neo4j. We will then create a graph of the most common bigrams in the english language and perform some queries on it. If you don't know what neo4j is, it is a graph database. It acts like a database in the sense that you can query it but the underlying datastructure is not a table or a document store but a graph. More information <a href="http://neo4j.org/learn">here</a>.</p>

<p>This document is intended both as a bare minimum introduction on cypher, the neo4j query language as well as a small reflection on the graphical representation of bigrams. In this document I only assume that you know what code is, what a graph is and what a database is.</p>

<h1>What we will make and Setup</h1>

<p>In reality we will fill a database, but essentially the database will represent an object that can be modelled as a graph like below.</p>

<div id="graphviz">
	
</div>
<p>In this graph a node represents a word and a link represents a bigram. A sentence can then be represented through a path over the network. The likeliness of a sentence could be estimated by keeping track of the likelihood of individual bigrams in the path. We will explore some of the boundaries of using such a network as a language model in neo4j.</p>

<p> To get started, you need to do the following: </p>

</div>
<div class="col-md-4">
<h3>Setup Neo4j</h3>

<ol>
<li>Go to neo4j.org and press the big download button.</li>
<li>Unzip contents to a folder and cd to it via terminal.</li>
<li>From the folder you just unzipped, type: <br><br>

<pre><code>$  ./bin/neo4j start</code></pre>

This will start the neo4j server from the <code>bin</code> folder.
 </li>

<li>Now that the server has started you can type <code>localhost:7474</code> in your webbrowser to confirm that the neo4j server has been successfully set up.</li>
<li>In the browser, run the following code to make sure we start out with an empty neo4j database: <br><br>

<pre><code>MATCH (n)
OPTIONAL MATCH (n)-[r]-()
DELETE n,r;</code></pre>

	Don't worry too much about how this code works. For now you may assume that it selects all nodes and links and deletes them. 
</li>
</ol>
</div>
<div class="col-md-4">
<h3>Download Bigrams</h3>

<ol>
<li>Go to <a href="http://www.ngrams.info">http://www.ngrams.info</a> and download 1000000 non case sensitive bigrams found.</li>
<li>Unzip this file and check that the file contains the following first lines;</li>
</ol>

<pre><code>$  head -15 w2.txt
275 a   a
31  a   aaa
29  a   all
45  a   an
192 a   and
39  a   another
25  a   at
82  a   b
45  a   b+
26  a   b-17
31  a   b-2
54  a   b-52
39  a   b-movie
40  a   b-plus
168 a   b.a
</code></pre>

<p>The <code>w2.txt</code> file contains a tab seperated file that has three columns; the frequency of the bigram, the first word and the second word. We will use this file to contruct a tree.</p>

</div>
<div class="col-md-4">
<h3>Upload Data to Neo</h3>

<h5>1. Start the neo4j shell by typing:</h5>

<pre><code>$  ./bin/neo4j-shell
Welcome to the Neo4j Shell! Enter 'help' for a list of commands
NOTE: Remote Neo4j graph database service 'shell' at port 1337

neo4j-sh (?)$
</code></pre>

<h5>2. Paste the following import script into the shell.</h5>

<pre><code>CREATE CONSTRAINT ON (w:Word) ASSERT w.value IS UNIQUE;
USING PERIODIC COMMIT
LOAD CSV FROM
  "file:/Users/code/Downloads/w2.txt"
  AS line
  FIELDTERMINATOR '\t'
MERGE (w1:Word { value: toString(line[1]) })
MERGE (w2:Word { value: toString(line[2]) })
CREATE (w1)-[:LINK { value : toInt(line[0])} ]-&gt;(w2);
</code></pre>

<p>Note that this is not an operation that will finish instantly. It takes about 2-3 minutes to run on my 2014 macbook. Be humble. We've just uploaded most of the english language in our little local database.</p>

</div>
<div class="col-md-12">
<h1>Cypher</h1>

<p>Cypher is the query language that Neo4j uses. It will feel familiar to SQL but more flexible. For more info, check the <a href="http://docs.neo4j.org/refcard/1.9/">syntax reference</a>.All of the queries below can be passed in either the neo4j console or the localhost:7474 website you already opened.</p>

<h3>Basic Queries</h3>

<p>These queries will look for nodes and links in the network just like SQL questies look for rows and columns in a table database. We can use the familiar <code>where</code> statements and also operators that <code>order by</code> or <code>count</code>. I will refrain from discussing the full API here but the following queries should help you get started with Cypher.</p>

</div>
</div>
<div class="row">
<div class="col-md-6">
<h4>Find 10 bigrams that start with "stairs"</h4>

<h6>Query</h6>
<pre><code>match (w1)-[l1]-&gt;(w2) 
where w1.value='stairs' 
return w1,l1,w2 
limit 10;
</code></pre>

<h6>Output</h6>
<pre><code>+-----------------------------------------------------------------------+
| w1                     | l1                 | w2                      |
+-----------------------------------------------------------------------+
| Node[]{value:"stairs"} | :LINK[]{value:33}  | Node[]{value:"without"} |
| Node[]{value:"stairs"} | :LINK[]{value:183} | Node[]{value:"with"}    |
| Node[]{value:"stairs"} | :LINK[]{value:71}  | Node[]{value:"when"}    |
| Node[]{value:"stairs"} | :LINK[]{value:81}  | Node[]{value:"were"}    |
| Node[]{value:"stairs"} | :LINK[]{value:56}  | Node[]{value:"was"}     |
| Node[]{value:"stairs"} | :LINK[]{value:31}  | Node[]{value:"up"}      |
| Node[]{value:"stairs"} | :LINK[]{value:90}  | Node[]{value:"two"}     |
| Node[]{value:"stairs"} | :LINK[]{value:24}  | Node[]{value:"a"}       |
| Node[]{value:"stairs"} | :LINK[]{value:30}  | Node[]{value:"after"}   |
| Node[]{value:"stairs"} | :LINK[]{value:26}  | Node[]{value:"again"}   |
+-----------------------------------------------------------------------+
10 rows
2546 ms
</code></pre>

<p> Note that I have abbreviated the ouput to make it more readable for the blog. The localhost:7474 webinterface will be able to also visualise this graph for you. </p>

</div>
<div class="col-md-6">
<h4>Combining Where Statements</h4>

<h6>Query</h6>
<pre><code>match (w1)-[l1]-&gt;(w2) 
where l1.value&gt;35000 and NOT w1.value = 'a'
return w1,l1,w2 
limit 10;
</code></pre>
<h6>Output</h6>

<pre><code>+---------------------------------------------------------------------+
| w1                  | l1                    |  w2                   |
+---------------------------------------------------------------------+
| Node[]{value:"all"} | :LINK[]{value:167854} | Node[]{value:"the"}   |
| Node[]{value:"all"} | :LINK[]{value:61867}  | Node[]{value:"right"} |
| Node[]{value:"all"} | :LINK[]{value:106921} | Node[]{value:"of"}    |
| Node[]{value:"and"} | :LINK[]{value:101358} | Node[]{value:"you"}   |
| Node[]{value:"and"} | :LINK[]{value:40499}  | Node[]{value:"when"}  |
| Node[]{value:"and"} | :LINK[]{value:52934}  | Node[]{value:"what"}  |
| Node[]{value:"and"} | :LINK[]{value:115823} | Node[]{value:"we"}    |
| Node[]{value:"and"} | :LINK[]{value:35655}  | Node[]{value:"was"}   |
| Node[]{value:"and"} | :LINK[]{value:78118}  | Node[]{value:"to"}    |
| Node[]{value:"and"} | :LINK[]{value:41548}  | Node[]{value:"this"}  |
+---------------------------------------------------------------------+
20 rows
817 ms
</code></pre>

</div>
</div>
<div class="row">
<div class="col-md-4">

<h4>Find the most frequently used bigrams</h4>

<h6>Query:</h6>

<pre><code>match (w1:Word)-[l1]-&gt;(w2:Word) 
return w1.value, l1.value, w2.value
order by l1.value descending
limit 20;
</code></pre>

<h6>Output:</h6>

<pre><code>--------------------------------+
| w1.value | l1.value | w2.value |
+--------------------------------+
| "of"     | 2586813  | "the"    |
| "in"     | 2043262  | "the"    |
| "to"     | 1055301  | "the"    |
| "on"     | 920079   | "the"    |
| "and"    | 737714   | "the"    |
| "to"     | 657504   | "be"     |
| "at"     | 617976   | "the"    |
| "for"    | 616400   | "the"    |
| "in"     | 544137   | "a"      |
| "do"     | 537718   | "n't"    |
| "with"   | 477541   | "the"    |
| "from"   | 472490   | "the"    |
| "it"     | 466117   | "was"    |
| "of"     | 444998   | "a"      |
| "that"   | 399074   | "the"    |
| "as"     | 365847   | "a"      |
| "is"     | 364083   | "a"      |
| "going"  | 363524   | "to"     |
| "by"     | 361826   | "the"    |
| "and"    | 345078   | "i"      |
+--------------------------------+
20 rows
3418 ms
</code></pre>

<p>The output seems logical. All the bigrams listed seem like common constructs in an english sentence.</p>

</div>
<div class="col-md-4">
<h4>Find the least common bigrams</h4>
<h6>Query:</h6>
<pre><code>match (w1:Word)-[l1]-&gt;(w2:Word) 
return w1.value,l1.value, w2.value
order by l1.value ascending
limit 20;
</code></pre>

<h6>Output:</h6>

<pre><code>+------------------------------------------+
| w1.value | l1.value | w2.value           |
+------------------------------------------+
| "a"      | 23       | "zucchini"         |
| "a"      | 23       | "zit"              |
| "a"      | 23       | "year-to-year"     |
| "a"      | 23       | "yeoman"           |
| "a"      | 23       | "zinger"           |
| "a"      | 23       | "wetsuit"          |
| "a"      | 23       | "whetstone"        |
| "a"      | 23       | "white-owned"      |
| "a"      | 23       | "woefully"         |
| "a"      | 23       | "wrecker"          |
| "a"      | 23       | "vp"               |
| "a"      | 23       | "w"                |
| "a"      | 23       | "warmonger"        |
| "a"      | 23       | "washed"           |
| "a"      | 23       | "washerwoman"      |
| "a"      | 23       | "water-soluble"    |
| "a"      | 23       | "wealthier"        |
| "a"      | 23       | "week-old"         |
| "a"      | 23       | "well-constructed" |
| "a"      | 23       | "westward"         |
+------------------------------------------+
20 rows
3250 ms
</code></pre>

<p>The output seems pausible enough if you consider that we only have a subset of all bigrams. It might seem slightly suspisious that all these links have a value of 23 but we need to keep in mind that we don't have the bigrams that do not belong to the top 1000000 bigrams.</p>
</div>

<div class="col-md-4">
<h4>Find the least common words</h4>

<h6>Query:</h6>
<pre><code>match p = (w1:Word)-[*1..4]-&gt;(w2:Word)
where w2.value='python' 
return extract( n in nodes(p) | n.value ) 
limit 20;
</code></pre>

<h6>Output:</h6>
<pre><code>+------------------------------------------+
| extract( n in nodes(p) | n.value )       |
+------------------------------------------+
|["the","python"]                          |
|["the","the","python"]                    |
|["zone","the","the","python"]             |
|["war","zone","the","the","python"]       |
|["vulnerable","zone","the","the","python"]|
|["usda","zone","the","the","python"]      |
|["twilight","zone","the","the","python"]  |
|["transition","zone","the","the","python"]|
|["training","zone","the","the","python"]  |
|["trade","zone","the","the","python"]     |
|["to","zone","the","the","python"]        |
|["time","zone","the","the","python"]      |
|["this","zone","the","the","python"]      |
|["their","zone","the","the","python"]     |
|["the","zone","the","the","python"]       |
|["that","zone","the","the","python"]      |
|["temperate","zone","the","the","python"] |
|["target","zone","the","the","python"]    |
|["subduction","zone","the","the","python"]|
|["strike","zone","the","the","python"]    |
+-------------------------------------------+
20 rows
46 ms
</code></pre>

<p>We are asking for all paths where the last word is 'python'. When looking at the results it seems like a bigram can exist between two identical words. This query might need to be adapted to prevent cycles in the path. </p>
</div>


<div class="col-md-12">
	<h2>Advanced Queries</h2>
</div>


<div class="col-md-6">
<h4>Short Paths</h4>

<h6>Query:</h6>
<pre><code>match (w1:Word{value:'monk'}),
      (w2:Word{value:'python'}),
      path = shortestPath((w1)-[*..5]-(w2))
return extract( n in nodes(path) | n.value );
</code></pre>

<h6>Output:</h6>
<pre><code>+---------------------------------------+
| extract( n in nodes(path) | n.value ) |
+---------------------------------------+
| ["monk","and","python"]                |
+---------------------------------------+
1 row
22 ms
</code></pre>

<p> Being able to find shortest paths is a very nice feature of the cypher language. Note that for large and more sparse networks this will be a more expensive operation. Our graph is small and most bigrams are connected via stopwords, but not all graphs have this property.</p>

<p>Note the <code>extract( n in nodes(path) | n.value )</code> syntax, this is the cypher way of performing a list comprehension. </p>

<p> Cypher prefers that you not use functions like <code>sum</code> on the <code>extract</code> output and instead prefers that you use the <code>reduce</code> method. </p>
</div>



<div class="col-md-6">
<h4>Long Paths</h4>

<h6>Query:</h6>
<pre><code>MATCH p = (w1:Word)-[*3]->(w2:Word)
WHERE w2.value='python' 
RETURN extract( n in nodes(p) | n.value ) as words, 
extract( l in relationships(p) | l.value ) as values, 
reduce(sum=0, nn IN relationships(p) |  sum + nn.value) as sum 
ORDER BY sum DESC
LIMIT 20;
</code></pre>
<!-- sort by bigram values: sum -->
<h6>Output:</h6>
<pre><code>+-----------------------------------------------------------------+
| words                           | values              | sum     |
+-----------------------------------------------------------------+
| ["one","of","the","python"]     | [299439,2586813,93] | 2886345 |
| ["out","of","the","python"]     | [257291,2586813,93] | 2844197 |
| ["kind","of","the","python"]    | [154645,2586813,93] | 2741551 |
| ["lot","of","the","python"]     | [149324,2586813,93] | 2736230 |
| ["part","of","the","python"]    | [143275,2586813,93] | 2730181 |
| ["some","of","the","python"]    | [130213,2586813,93] | 2717119 |
| ["all","of","the","python"]     | [106921,2586813,93] | 2693827 |
| ["number","of","the","python"]  | [102156,2586813,93] | 2689062 |
| ["most","of","the","python"]    | [84822,2586813,93]  | 2671728 |
| ["because","of","the","python"] | [83493,2586813,93]  | 2670399 |
| ["percent","of","the","python"] | [81211,2586813,93]  | 2668117 |
| ["end","of","the","python"]     | [74265,2586813,93]  | 2661171 |
| ["sort","of","the","python"]    | [66556,2586813,93]  | 2653462 |
| ["many","of","the","python"]    | [60466,2586813,93]  | 2647372 |
| ["use","of","the","python"]     | [51132,2586813,93]  | 2638038 |
| ["sense","of","the","python"]   | [49201,2586813,93]  | 2636107 |
| ["front","of","the","python"]   | [46572,2586813,93]  | 2633478 |
| ["side","of","the","python"]    | [43912,2586813,93]  | 2630818 |
| ["much","of","the","python"]    | [43602,2586813,93]  | 2630508 |
| ["rest","of","the","python"]    | [43144,2586813,93]  | 2630050 |
+-----------------------------------------------------------------+
20 rows
19597 ms
</code></pre>

<p>Note that this query significantly more time consuming. This is because we are not interested in ANY path that meets the description but we now want the top 20 paths. This means that every path might need to be taken into consideration instead of just the first 20 paths that are found.</p>
</div>

<div class="col-md-12">
	<h1>Conclusions</h1>
	<p> Neo4j is very flexible because it offers the graph datastructure in a database tool. This means that you can add very complex data to the databse without being compromised for expressiveness. Cypher is a simple language that allows for many complex queries. If you quickly need a tool (without the need to set up a hadoop environment) to analyze a graph structure then neo4j is tough to beat. Not all graph problems are easy though. These tutorial examples are purposefully kept small and you will notice that things go slower when more complexity is introduced. All paths like <code>p = (w1:Word)-[*3]->(w2:Word)</code> will be much faster to obtain than paths like <code>p = (w1:Word)-[*6]->(w2:Word)</code>. Also keep in mind that my interest here is analyzing data, scaling neo4j for real time applications is a different domain and you would need to take many things I have not discussed here into consideration.</p>
	<p>The bigram graph model is a nice representation of how words might be related but it needs work before it might have an application. We have seen bigrams with the same word in it and there might be other data input errors that need cleaning.</p>
	<p>The main issue is that we need more information for these paths on the graph to have any meaning. If we want to use bigrams to value the correctness of a sentence by looking at the occurence then bigrams like <code>"of" - "the"</code> will always appear in every sentence. The data would need to be expanded with trigrams make the model more interesting.</p>
	<p>If you are interested in more datasets that you can use with neo4j then check out this <a href="http://www.neo4j.org/develop/example_data">resource</a>.</p>
</div>



		<div class="col-md-12">
<a href="/">back to main</a>
	</div>
	   		<div id="disqus_thread"></div>
    <script type="text/javascript">
        /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
        var disqus_shortname = 'koaningcom'; // required: replace example with your forum shortname

        /* * * DON'T EDIT BELOW THIS LINE * * */
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>


	</div>
</div>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-28011256-3', 'auto');
  ga('send', 'pageview');

</script>
    <script src="http://ajax.googleapis.com/ajax/libs/jquery/1.10.2/jquery.min.js"></script>
    <script src="http://cdnjs.cloudflare.com/ajax/libs/d3/3.4.1/d3.min.js"></script>
	<script src="//ajax.googleapis.com/ajax/libs/jqueryui/1.10.4/jquery-ui.min.js"></script>
    <script src="http://netdna.bootstrapcdn.com/bootstrap/3.1.1/js/bootstrap.min.js"></script>
	<script src="/js/prism.js"></script>
	<script src="neo4jbigrams/neo4jbigrams.js"></script>